<template>
  <div class="protocol">
    <nav-layout v-if="isCN" title="服务与隐私条款"></nav-layout>
    <nav-layout v-else title="Services and Privacy Terms"></nav-layout>
    <div class="wrapper" v-if="isCN">
      <p style="margin-top:0;">尊敬的用户:</p>
      <p>感谢您选择由深圳市天杭科技有限公司开发并运营的维基时代服务。《维基时代服务协议》 (以下简称“本协议”)由维基链和用户(以下简称“您”或“用户”)签订，本协议在您与 维基链之间具有合同上的法律效力。 维基链在此特别提醒您在使用维基时代(以下简称“维基时代” 或“本软件”)之前，请认 真阅读《维基时代服务协议》及后文提到的相关协议，尤其是本协议规定的“免责及责任限 制”等条款将以加粗的形式体现，确保您充分理解本协议中各条款，并自主考虑风险。</p>
      <h3>一、 关于本协议的确认与接纳</h3>
      <p>1. 您理解本协议及有关协议适用于维基时代及维基时代上维基链所自主开发和拥有的去中 心化应用(简称“DApp”)(排除第三方开发的 DApp)。</p>
      <p>2. 您下载维基时代软件并创建或导入钱包，即视为您已经充分阅读并接受本协议全部条款， 本协议立即生效，对双方具有约束力。</p>
      <p>3. 本协议可由维基链随时更新，经修改的协议一经在维基时代上公布，立即自动生效，恕 不再另行通知。在维基链公布修改协议条款后，如果您不接受修改后的条款，请立即停止使 用维基时代，您继续使用维基时代将被视为接受修改后的协议。</p>
      <p>4. 如果您未满18周岁，或者是无民事行为能力人或限制民事行为能力人，请在父母或监护 人指导下使用维基时代。</p>
      <h3>二、 定义</h3>
      <p>1. 维基时代:指由维基链开发、运营和管理的区块链钱包，维基链通过该钱包为用户提供 进行数字资产管理的网络平台服务。</p>
      <p>2. 用户:</p>
      <p>(1)用户必须是具备完全民事行为能力的自然人;</p>
      <p>(2)若您为 18 周岁以下的未成年人使用维基时代服务，需要在您父母或监护人的指导下 使用维基时代。无民事行为能力人使用维基时代或限制民事行为能力人超过其民事权利或行 为能力范围从事交易的，造成的一切后果，维基时代有权要求您及您的父母或监护人负责。 3. 创建或导入钱包:指您使用维基时代，确认履行本协议并创建或导入钱包的过程。</p>
      <p>4. 钱包密码:指您在创建或导入维基时代钱包过程中，软件操作界面提示您填写的密码， 该密码用于加密保护私钥。作为去中心化的应用，钱包密码不存储在您的这台移动设备或维 基链的服务器，一旦丢失你需要借助明文私钥或助记词重置新密码。</p>
      <p>5. 信息提示:维基时代软件操作界面涉及的信息提示内容，建议用户按照相关步骤进行操 作。</p>
      <p>6. 私钥:由 256 位随机字符构成，是用户拥有并使用数字代币的核心。</p>
      <p>7. 公钥:由私钥借助密码学原理单向推导生成，并用以生成区块链数字钱包地址，数字钱 包地址即为公开收款地址。</p>
      <p>8. 助记词:符合区块链 BIP39 行业标准，由随机算法生成的 12(或 15/18/21/24)个有 序单词组成。是私钥的易记录表现形式，方便用户备份保管。</p>
      <p>9. 数字代币:指维基时代目前支持的数字代币种类，包括但不限于 WICC、SPC 等。</p>
      <h3>三、 服务内容</h3>
      <p>1. 创建或导入钱包。您有权在维基时代浏览数字资产实际信息、有权通过维基时代创建或 者导入钱包</p>
      <p>2. 转账、收款。您可以使用维基时代的转账、收款功能进行数字代币的管理，即运用私钥 进行电子签名，对相关区块链的账本进行修改。转账是指付款方利用收款方的区块链地址进</p>
      <p>行转账操作，实际的转账、收款行为均在相关区块链系统(而非维基时代)发生。</p>
      <p>3. 浏览或使用 DApp。您可以浏览或使用维基时代上的 DApp(包括维基链自己的 DApp 和第三方 DApp)所提供的服务。</p>
      <p>4. 交易记录。我们将通过区块链系统拷贝您全部或部分的交易记录。但交易记录以区块链 系统的记载为准。</p>
      <p>5. 暂停服务。您知悉基于区块链系统交易“不可撤销”的属性，我们不能为您暂停或撤销 转账交易等操作，但在一定情况下，我们可以暂停或者限制某位用户对维基时代软件的操作。 6. 其他维基链认为有必要提供的服务。 用户接受维基链提供的上述服务时应了解以下常见问题:</p>
      <p>1. 秉承着区块链的去中心化特点，并为了保护用户的数字代币安全，维基链提供的是去中 心化服务，大大区别于银行业金融机构。用户了解，维基链不提供以下服务: (1)存储用户的钱包密码(即用户创建/导入钱包时设置的密码)、私钥、助记词; (2)找回用户的钱包密码、私钥、助记词;</p>
      <p>(3)冻结钱包;</p>
      <p>(4)挂失钱包;</p>
      <p>(5)恢复钱包;</p>
      <p>(6)交易回滚。</p>
      <p>2. 由于维基链不提供上述服务，因此用户应当自行保管含有维基时代的移动设备、备份维 基时代、备份钱包密码、助记词及私钥。如用户遗失移动设备、删除且未备份维基时代、删 除且未备份钱包、钱包被盗或遗忘钱包密码、私钥、助记词，维基链均无法还原钱包或找回 钱包密码、私钥、助记词;如用户进行交易时误操作(例如输错转账地址)，维基链亦无法 取消交易。</p>
      <p>3. 维基链和维基时代所能够提供的数字代币管理服务并未包括所有已存在的数字代币，请 勿通过维基时代操作任何维基时代不支持的数字代币。</p>
      <p>4. 维基时代仅是用户的数字代币管理工具，并非交易所或交易平台。虽然本协议将多次提 及“交易”，其行为泛指用户使用维基时代进行的转账和收款操作，这与交易所或交易平台 上进行的“交易”有本质区别。</p>
      <p>5. 维基时代上集成的 DApp 包括维基链自主拥有的 DApp 和第三方平台提供的 DApp。对 于第三方平台提供的 DApp，维基时代仅为用户进入 DApp 提供区块链浏览器。用户在第 三方 DApp 上接受服务或进行交易前应自行判断和评估该第三方 DApp 提供的服务或交易 是否存在风险。</p>
      <h3>四、 您的权利义务</h3>
      <p>(一)创建或导入钱包</p>
      <p>1. 创建或导入钱包:您有权在您的移动设备上通过维基时代创建和/或导入钱包，有权设定 钱包的钱包密码等信息，并有权通过维基时代应用程序，使用自己的钱包在区块链上进行转 账和收款等交易。</p>
      <p>2. 维基链可能为不同的终端设备开发不同的软件版本，您应当根据实际需要选择下载合适 的版本进行安装。如果您从未经合法授权的第三方获取本软件或与本软件名称相同的安装程 序，维基链将无法保证该软件能否正常使用，也无法保证其安全性，因此造成的损失由您自 行承担。</p>
      <p>3. 本软件新版本发布后，旧版软件可能无法使用。维基链不保证旧版软件的安全性、继续 可用性及提供相应的客户服务。请您随时核对并下载最新版本。</p>
      <p>(二)使用</p>
      <p>1. 用户应自行妥善保管移动设备、钱包密码、私钥、助记词等信息。维基链不负责为用户</p>
      <p>保管以上信息。因您遗失移动设备、主动或被动泄露、遗忘钱包密码、私钥、助记词或遭受 他人攻击、诈骗等所引起的一切风险、责任、损失、费用应由您自行承担。</p>
      <p>2. 遵循信息提示。您了解并同意遵循维基时代对您做出的信息提示，按照信息提示的内容 进行操作，否则，由此引起的一切风险、责任、损失、费用等应由您自行承担。</p>
      <p>3. 您知悉并理解维基时代没有义务对链接的第三方 DApp 服务或交易履行尽职调查义务， 您应当理性做出投资决策并自主承担相应的投资风险。</p>
      <p>4. 积极完成身份验证。当维基时代合理认为您的交易行为或交易情况出现异常的，或认为 您的身份信息存在疑点的，或维基时代认为应核对您身份证件或其他必要文件的情形时，请 您积极配合维基时代核对您的有效身份证件或其他必要文件，及时完成相关的身份验证。</p>
      <p>5. 转账。 (1)您知悉对于维基时代服务中您可使用的日计转账限额和笔数，可能因为您使用该转账 服务时所处的国家/地区、监管要求、转账目的、维基时代风险控制、身份验证等事由而不 同。 (2)您理解基于区块链操作的“不可撤销”属性，当您使用维基时代转账功能时，您应当 自行承担因您操作失误而导致的后果(包括但不限于因您输错转账地址问题)。 (3)您知悉在使用维基时代服务时，以下情况的出现可能导致转账“交易失败”或“打包 超时”:</p>
      <p>a) 钱包余额不足;</p>
      <p>b) 交易矿工费不足;</p>
      <p>c) 区块链执行合约代码失败;</p>
      <p>d) 超出监管部门、维基时代或法律法规规定的付款额度; e) 网络、设备等技术故障;</p>
      <p>f) 区块链网络拥堵、故障等原因引起交易被抛弃;</p>
      <p>g) 您的地址或交易对方地址被识别为特殊地址, 如高风险地址、交易所地址、ICO 地 址、Token 地址等。 (4)您知悉维基时代仅向您提供转账工具，在您使用维基时代完成转账后，维基链即完成 了当次服务的所有义务，维基链对其他纠纷争议，不负担任何义务。</p>
      <p>6. 合法合规。您知悉在维基时代进行操作时或利用维基时代上的 DApp 进行交易时，您应 当遵循有关法律法规、国家政策的要求。</p>
      <p>7. 公告通知。维基时代会以网站公告、电子邮件、发送短信、电话、消息中心信息、弹窗 提示或客户端通知等方式向您发送通知，例如通知您交易进展情况，或者提示您进行相关操 作，请您及时予以关注。</p>
      <p>8. 服务费用与纳税义务: (1)维基时代暂时不向您收取任何形式的服务费或手续费，将来需对某些服务进行收费时 将另行约定或公布规则; (2)您使用维基时代进行转账时应支付矿工费，金额由您自行决定。矿工费由相关区块链 系统收取; (3)您知悉在特定情况下，因为您所处的环境及网络状态不稳定，导致您的转账操作未完 成时，亦会被相关区块链系统收取矿工费; (4)您因在维基时代进行交易而发生的所有应纳税负及其它方面的费用均由您负责支付。</p>
      <h3>五、 风险提示</h3>
      <p>1. 您了解并知悉，由于数字代币领域的法律法规政策尚未健全，该领域的数字代币可能会 产生无法兑现、技术不稳定等重大风险。且数字代币的价格波动幅度远高于其他金融资产。 我们谨慎提醒您应当根据自身财务状况和风险偏好，理性选择持有或处置任何一种数字代</p>
      <p>币。维基时代提供的行情查看功能仅系抓取部分交易所的数字代币汇率信息的搜索结果，并 不表示为最新行情或最佳报价。</p>
      <p>2. 在使用维基时代服务时，若您或您的相对方未遵从本协议或相关网站说明、交易、支付 页面中之操作提示、规则，维基时代并不保证交易会顺利完成，且维基时代不承担损害赔偿 责任。若发生前述情形，而款项已先行入账您的或您的交易方的维基时代钱包或第三方钱包， 您理解区块链操作具有的“不可逆”属性，以及相关交易具有“不可撤销”的特征，由您及 您的相对方自行承担相应的风险后果。</p>
      <p>3. 在您使用维基时代集成的第三方 DApp 服务或进行交易时，为了您的利益，维基链建议 您仔细阅读本协议及维基时代提示，了解交易对象及产品信息，谨慎评估风险后再采取行动。 所有您在第三方 DApp 进行的交易行为系您的个人行为，有约束力的合同关系在您和您的 相对方之间建立，与维基时代无关。维基时代对因您的交易行为所引起的一切风险、责任、 损失、费用不承担任何责任。</p>
      <p>4. 您在交易过程中应当自行判断对方是否为完全民事行为能力人并自行决定是否与对方进 行交易或转账给对方等，且您自行承担与此相关的所有风险。</p>
      <p>5. 在转账过程中，如果出现“交易失败”、“打包超时”等类似的异常信息提示时，您应通 过相关区块链系统的官方途径或其他的区块链查询工具进行再次确认，以避免重复转账;否 则，由此所引起的一切损失和费用应由您自行承担。</p>
      <p>6. 您理解当您在维基时代上创建或导入钱包之后，您的、私钥、助记词等信息仅存储在当 前的这台移动设备中，不存储在维基时代或维基链的服务器上。您可以按照维基时代提供的 操作指南采取同步钱包等方式更换移动设备。但若您未保存或备份钱包密码、私钥、助记词 等信息且在您移动设备丢失的情况下，您的数字代币将因此丢失，维基链无法为您找回，您 需自行承担相应损失。若您在导出、保存或备份钱包密码、私钥、助记词等信息的时候泄密，</p>
      <p>或保存或备份上述信息的设备或服务器被黑客攻击或控制等情况下，您的数字代币将因此丢 失，维基链无法为您找回，您需自行承担相应损失。</p>
      <p>7. 我们建议您在创建或导入钱包时对您钱包的钱包密码、私钥、助记词等信息做好安全备 份。我们提请您注意，请不要采用以下备份方式:截图、邮件、记事本、短信、微信、QQ 等电子备份方式。我们建议您在纸质记事本上抄写助记词等信息，同时您亦可将电子数据保 管至密码管理器。</p>
      <p>8. 我们建议您在安全的网络环境中使用维基时代，确保您的移动设备没有越狱或 Root，以 避免可能存在的安全隐患</p>
      <p>9. 请您在使用我们的服务过程中，警惕非维基时代官方的诈骗行为。一旦发现此类行为， 我们鼓励您第一时间告知我们。</p>
      <h3>六、 服务的变更、中断、终止</h3>
      <p>1. 您同意维基链为保证自主业务经营权可以暂时提供部分服务功能，或于将来暂停部分服 务功能或开通新的服务功能。当任何功能减少或者增加或者变化时，只要您仍然使用维基链 提供的服务，表示您仍然同意本协议或者本协议修正后的条款。</p>
      <p>2. 您理解存在如下情形时，维基链将暂停提供服务: (1)因设备、区块链系统维修、升级、故障和通信中断等技术原因而中断业务; (2)因台风、地震、海啸、洪水、停电、战争或恐怖袭击等不可抗力因素，病毒、木马、 黑客攻击、系统不稳定或政府行为等原因，造成维基链系统不能提供服务或维基链合理认为 继续提供服务会有较大风险的;</p>
      <p>(3)发生维基链无法控制或合理预见的其他情形。</p>
      <p>3. 当您出现如下情况时，维基链可单方面中止或终止您使用维基时代的部分或全部功能: (1)用户死亡;</p>
      <p>(2)盗用他人的钱包信息或移动设备; (3)拒绝维基链为提升维基时代功能而发起的强制更新操作; (4)将维基时代用于违法或犯罪活动;</p>
      <p>(5)妨碍其他用户正常使用;</p>
      <p>(6)伪称维基链的工作人员或管理人员; (7)攻击、侵入、更改或以任何其他方式威胁维基链计算机系统的正常运作; (8)利用维基时代宣传垃圾广告;</p>
      <p>(9)散布谣言，损害维基链和维基时代商誉; (10)违法行为，其他违反本协议的行为，及维基链合理认为应当暂停功能的情形。</p>
      <p>4. 当您与维基链之间的服务关系变更、中断、终止时，您仍有权在合理时间内导出您钱包 等信息。</p>
      <h3>七、 您合法使用维基链服务的承诺</h3>
      <p>1. 您应遵守中华人民共和国相关法律法规及您所居住的国家或地区的法律法规，不得将维 基时代用于任何非法目的，也不得以任何非法方式使用维基链服务。</p>
      <p>2. 您不得利用维基时代从事违法或犯罪的行为，包括但不限于: (1)反对宪法所确定的基本原则，危害国家安全、泄漏国家秘密、颠覆国家政权、破坏国 家统一的;</p>
      <p>(2)从事任何违法犯罪行为，包括但不限于洗钱、非法集资等; (3)通过使用任何自动化程序、软件、引擎、网络爬虫、网页分析工具、数据挖掘工具或 类似工具，接入维基链服务、收集或处理维基链所提供的内容，干预或试图干预任何用户或 任何其他方式接入维基链服务的行为; (4)提供赌博资讯或以任何方式引诱他人参与赌博;</p>
      <p>(5)侵入他人维基时代钱包盗取数字代币; (6)进行与交易对方宣称的交易内容不符的交易，或不真实的交易; (7)从事任何侵害或可能侵害维基时代服务系统、数据之行为; (8)其他违法以及维基链有正当理由认为不适当的行为。</p>
      <p>3. 您理解并同意，如因您违反有关法律(包括但不限于海关及税务方面的监管规定)或者 本协议之规定，使维基链遭受任何损失、受到任何第三方的索赔或任何行政管理部门的处罚， 您应对维基链进行赔偿，包括合理的律师费用。</p>
      <p>4. 您承诺按时缴纳维基链的服务费用(如有)，否则维基链有权暂停或中止对您提供的服务。</p>
      <h3>八、 隐私条款</h3>
      <p>1. 维基链十分重视对用户隐私的保护，相关隐私保护政策请参考维基链公布并不时更新的 《维基时代隐私政策》。</p>
      <h3>九、 免责及责任限制</h3>
      <p>1. 维基链仅对本协议中所列明的义务承担责任。</p>
      <p>2. 您理解和同意，在法律所允许的范围内，维基链只能按照现有的技术水平和条件提供服 务。因下列原因导致维基时代无法正常提供服务，维基链不承担责任: (1)维基时代系统停机维护或升级; (2)因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因; (3)您的移动设备软硬件和通信线路、供电线路出现故障的; (4)您操作不当或未通过维基链授权或认可的方式使用维基链服务的; (5)因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、 电力故障、银行等原因或政府行为等原因; (6)非因维基链的原因而引起的任何其它原因。</p>
      <p>3. 维基链对以下情形不承担责任: (1)因用户遗失移动设备、删除且未备份维基时代、删除且未备份钱包、钱包被盗或遗忘 钱包密码、私钥、助记词而导致的数字代币丢失; (2)因用户自行泄露钱包密码、私钥、助记词，或借用、转让或授权他人使用自己的移动 设备或维基时代钱包，或未通过维基链官方渠道下载维基时代应用程序或其他不安全的方式 使用维基时代应用程序导致的数字代币丢失; (3)因用户误操作(包括但不限于您输错转账地址)导致的数字代币丢失; (4)因用户不理解区块链技术的性质而进行误操作导致的数字代币丢失; (5)因时间滞后、区块链系统不稳定等原因导致维基链拷贝用户在区块链上的交易记录发 生偏差;</p>
      <p>(6)用户在第三方 DApp 上操作产生的风险和后果。</p>
      <p>4. 您理解维基时代仅作为您数字代币管理的工具。维基链不能控制第三方 DApp 提供的产 品及服务的质量、安全或合法性，信息的真实性或准确性，以及相对方履行其在与您签订的 协议项下的各项义务的能力。所有您在第三方 DApp 进行的交易行为系您的个人行为，有 约束力的合同关系在您和您的相对方之间建立，与维基时代无关。维基链提醒您应该通过自 己的谨慎判断确定登录 DApp 及相关信息的真实性、合法性和有效性。您与任何第三方交 易所产生的风险亦应由您自行承担。</p>
      <p>5. 维基链可能同时为您及您的交易对手方提供服务，您同意对维基链可能存在的该等行为 予以明确豁免任何实际或潜在的利益冲突，并不得以此来主张维基链在提供服务时存在法律 上的瑕疵，也不因此而加重维基链的责任或注意义务。</p>
      <p>6. 维基链不提供以下形式的保证:</p>
      <p>(1)维基链服务将符合您的全部需求;</p>
      <p>(2)您经由维基链服务取得的任何技术、产品、服务、资讯将符合您的期望; (3)维基链从第三方交易所抓取的数字代币市场交易行情等信息的及时性、准确性、完整 性、可靠性做出保证; (4)您在维基时代上的交易各方会及时履行其在与您达成的交易协议中各项义务。</p>
      <p>7. 在任何情况下，维基链对本协议所承担的违约赔偿责任总额不超过 100 个以太币或人民 币 500 元，以较高的为准。</p>
      <p>8. 您理解维基时代仅作为用户管理数字代币、显示交易信息的工具，维基链不提供法律、 税务或投资建议等服务。您应当自行向法律、税务、投资方面的专业人士寻求建议，且您在 使用我们服务过程中所遭受的投资损失、数据损失等，维基链概不负责。</p>
      <p>9. 您理解根据有关中国政策法规的要求，我们可能不时更改我们的用户准入标准，限定向 某一特定群体提供服务的范围和方式等。</p>
      <h3>十、 完整协议</h3>
      <p>1. 本协议由《维基时代服务协议》、《维基时代隐私政策》及维基链不时公布的各项规则(包 括“帮助中心”的内容)组成。</p>
      <p>2. 本协议部分内容被有管辖权的法院认定为违反或无效的，不因此影响其他内容的效力。 3. 本协议的任何译文版本仅为方便用户而提供，无意对本协议的条款进行修改。如果本协 议的中文版本与非中文版本之间存在冲突，应以中文版本为准。</p>
      <h3>十一、 知识产权保护</h3>
      <p>1. 维基时代系维基链开发并拥有知识产权的应用程序。 维基时代中显示的任何内容(包括 本协议、公告、文章、视频、音频、图片、档案、资讯、资料、商标或标识)的知识产权归 维基链或第三方权利人所有。用户仅可为持有和管理数字代币之目的使用维基时代应用程序 及其中的内容。未经维基链或第三方权利人的事先书面同意，任何人不得擅自使用、修改、</p>
      <p>反向编译、复制、公开传播、改变、散布、发行或公开发表上述应用程序及内容。</p>
      <h3>十二、 法律适用与争议解决</h3>
      <p>1. 本协议及其修订版之效力、解释、变更、执行与争议解决均适用中华人民共和国法律， 如无相关法律规定，则应当适用国际商业惯例和(或)行业惯例。</p>
      <p>2. 若您和维基链之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，任何一方 可提交维基链所在地有管辖权的人民法院管辖。</p>
      <h3>十三、 其他</h3>
      <p>1. 如您是中华人民共和国以外用户，您需全面了解并遵守您所在司法辖区与使用维基链服 务所有相关法律、法规及规则。</p>
      <p>2. 您在使用维基链服务过程中，如遇到任何问题，您可以通过在维基时代提交反馈等方式 联系我们。</p>
      <p>3. 您可以在维基时代中查看本协议。维基链鼓励您在每次访问维基时代时都查阅维基链的 服务协议。</p>
      <p>4. 本协议自2018年4月4日起适用。 本协议未尽事宜，您需遵守维基链不时更新的公告及相关规则。</p>
      <h2>《“深圳市天杭科技有限公司”隐私政策》</h2>
      <p>尊敬的用户: 深圳市天杭科技有限公司尊重并保护用户(以下简称“您”或“用户”)的隐私，您使用维 基时代时，维基链将按照本隐私政策(以下简称“本政策”)收集、使用您的个人信息。</p>
      <p>维基链建议您在使用本产品(以下简称“维基时代”)之前仔细阅读并理解本政策全部内容, 针对免责声明等条款在内的重要信息将以加粗的形式体现。本政策有关关键词定义与维基链 《维基时代服务协议》保持一致。 本政策可由维基链在线随时更新，更新后的政策一旦公布即代替原来的政策，如果您不接受 修改后的条款，请立即停止使用维基时代，您继续使用维基时代将被视为接受修改后的政策。 经修改的政策一经在维基时代上公布，立即自动生效。 您知悉本政策及其他有关规定适用于维基时代及维基时代上维基链所自主拥有的 DApp。</p>
      <h3>一、 我们收集您的哪些信息</h3>
      <p>请您知悉，我们收集您的以下信息是出于满足您在维基时代服务需要的目的，且我们十分重 视对您隐私的保护。在我们收集您的信息时，将严格遵守“合法、正当、必要”的原则。且 您知悉，若您不提供我们服务所需的相关信息，您在维基时代的服务体验可能因此而受到影 响。</p>
      <p>1. 我们将收集您的移动设备信息、操作记录、交易记录、钱包地址等个人信息。</p>
      <p>2. 您知悉:您在维基时代 上的钱包密码、私钥、助记词并不存储或同步至维基链服务器。 维基链不提供找回您的钱包密码、私钥、助记词的服务。</p>
      <p>3. 除上述内容之外，您知悉在您使用维基时代特定功能时，我们将在收集您的个人信息前 向您作出特别提示，要求向您收集更多的个人信息。如您选择不同意，则视为您放弃使用维 基时代该特定功能。</p>
      <p>4. 当您跳转到第三方 DApp 后，第三方 DApp 会向您收集个人信息。维基时代不持有第三 方 DApp 向您收集的个人信息。</p>
      <p>5. 在法律法规允许的范围内，维基链可能会在以下情形中收集并使用您的个人信息无需征 得您的授权同意:</p>
      <p>(1) 与国家安全、国防安全有关的;</p>
      <p>(2) 与公共安全、公共卫生、重大公共利益有关的;</p>
      <p>(3) 与犯罪侦查、起诉、审判和判决执行等有关的;</p>
      <p>(4) 所收集的个人信息是您自行向社会公众公开的;</p>
      <p>(5) 从合法公开披露的信息中收集您的个人信息，如合法的新闻报道，政府信息公开等 渠道;</p>
      <p>(6) 用于维护服务的安全和合规所必需的，例如发现、处理产品和服务的故障;</p>
      <p>(7) 法律法规规定的其他情形。</p>
      <p>7. 我们收集信息的方式如下:</p>
      <p>(1) 您向我们提供信息。例如，您在“个人中心”页面中填写姓名、手机号码或银行卡 号，或在反馈问题时提供邮件地址，或在使用我们的特定服务时，您额外向我们提供。 (2) 我们在您使用维基时代的过程中获取信息，包括您移动设备信息以及您对维基时代 的操作记录等信息;</p>
      <p>(3) 我们通过区块链系统，拷贝您全部或部分的交易记录。但交易记录以区块链系统的 记载为准。</p>
      <h3>二、 我们如何使用您的信息</h3>
      <p>1. 我们通过您移动设备的唯一序列号，确认您与您的钱包的对应关系。</p>
      <p>2. 我们将向您及时发送重要通知，如软件更新、服务协议及本政策条款的变更。</p>
      <p>3. 我们通过收集您公开的钱包地址和提供的移动设备信息来处理您向我们提交的反馈。</p>
      <p>4. 我们收集您的个人信息进行维基链内部审计、数据分析和研究等，以期不断提升我们的 服务水平。</p>
      <p>5. 依照《维基时代服务协议》及维基链其他有关规定，维基链将利用用户信息对用户的使</p>
      <p>用行为进行管理及处理。</p>
      <p>6. 法律法规规定及与监管机构配合的要求。</p>
      <h3>三、 您如何控制自己的信息</h3>
      <p>您在维基时代中拥有以下对您个人信息自主控制权:</p>
      <p>1. 您可以通过同步钱包的方式，将您的其他钱包导入维基时代中，或者将您在维基时代的 钱包导入到其他数字代币管理钱包中。维基时代将向您显示导入钱包的信息。</p>
      <p>2. 您知悉您可以通过“资产”版块内容修改您的数字代币种类、进行转账及收款等活动。 3. 您知悉当我们出于特定目的向您收集信息时，我们会提前给予您通知，您有权选择拒绝。 但同时您知悉，当您选择拒绝提供有关信息时，即表示您放弃使用维基时代的有关服务。</p>
      <p>4. 您知悉，您及我们对于您交易记录是否公开并没有控制权，因为基于区块链交易系统的 开源属性，您的交易记录在整个区块链系统中公开透明。</p>
      <p>5. 您知悉当您使用维基时代的功能跳转至第三方 DApp 之后，我们的《维基时代服务协议》、 《维基时代隐私政策》将不再适用，针对您在第三方 DApp 上对您个人信息的控制权问题， 我们建议您在使用第三方 DApp 之前详细阅读并了解其隐私规则和有关用户服务协议等内 容。</p>
      <p>6. 您有权要求我们更新、更改、删除您的有关信息。</p>
      <p>7. 您知悉我们可以根据本政策第一条第 6 款的要求收集您的信息而无需获得您的授权同 意。</p>
      <h3>四、 我们可能分享或传输您的信息</h3>
      <p>1. 维基链在中华人民共和国境内收集和产生的用户个人信息将存储在中华人民共和国境内 的服务器上。若维基链确需向境外传输您的个人信息，将在事前获得您的授权，且按照有关 法律法规政策的要求进行跨境数据传输，并对您的个人信息履行保密义务。</p>
      <p>2. 未经您事先同意，维基链不会将您的个人信息向任何第三方共享或转让，但以下情况除 外:</p>
      <p>(1) 事先获得您明确的同意或授权;</p>
      <p>(2) 所收集的个人信息是您自行向社会公众公开的;</p>
      <p>(3) 所收集的个人信息系从合法公开披露的信息中收集，如合法的新闻报道，政府信息 公开等渠道;</p>
      <p>(4) 与维基链的关联方共享，我们只会共享必要的用户信息，且受本隐私条款中所声明 的目的的约束;</p>
      <p>(5) 根据适用的法律法规、法律程序的要求、行政机关或司法机关的要求进行提供; (6) 在涉及合并、收购时，如涉及到个人信息转让，维基链将要求个人信息接收方继续 接受本政策的约束。</p>
      <h3>五、 我们如何保护您的信息</h3>
      <p>1. 如维基链停止运营，维基链将及时停止继续收集您个人信息的活动，将停止运营的通知 公告在维基时代上，并对所持有的您的个人信息在合理期限内进行删除或匿名化处理。</p>
      <p>2. 为了保护您的个人信息，维基链将采取数据安全技术措施，提升内部合规水平，增加内 部员工信息安全培训，并对相关数据设置安全访问权限等方式安全保护您的隐私信息。</p>
      <h3>六、 对未成年人的保护</h3>
      <p>我们对保护未满 18 周岁的未成年人做出如下特别约定:</p>
      <p>1. 未成年人应当在父母或监护人指导下使用维基链相关服务。</p>
      <p>2. 我们建议未成年人的父母和监护人应当在阅读本政策、《维基时代服务协议》及我们的其 他有关规则的前提下，指导未成年人使用维基时代。</p>
      <p>3. 维基时代将根据国家相关法律法规的规定保护未成年人的个人信息的保密性及安全性。</p>
      <h3>七、 免责声明</h3>
      <p>1. 请您注意，您通过维基时代接入第三方 DApp 后，将适用该第三方 DApp 发布的隐私政 策。该第三方 DApp 对您个人信息的收集和使用不为维基链所控制，也不受本政策的约束。 维基链无法保证第三方 DApp 一定会按照维基链的要求采取个人信息保护措施。</p>
      <p>2. 您应审慎选择和使用第三方 DApp，并妥善保护好您的个人信息，维基链对其他第三方 DApp 的隐私保护不负任何责任。</p>
      <p>3. 维基链将在现有技术水平条件下尽可能采取合理的安全措施来保护您的个人信息，以避 免信息的泄露、篡改或者毁损。维基链系利用无线方式传输数据，因此，维基链无法确保通 过无线网络传输数据的隐私性和安全性。</p>
      <h3>八、 其他</h3>
      <p>1. 如您是中华人民共和国以外的用户，您需全面了解并遵守您所在司法辖区与使用维基链 服务所有相关法律、法规及规则。</p>
      <p>2. 您在使用维基链服务过程中，如遇到任何有关个人信息使用的问题，您可以通过在维基 时代提交反馈等方式联系我们。</p>
      <p>3. 您可以在维基时代中查看本政策及维基链其他服务规则。我们鼓励您在每次访问维基时 代时都查阅维基链的服务协议及隐私政策。</p>
      <p>4. 本政策的任何译文版本仅为方便用户而提供，无意对本政策的条款进行修改。如果本政 策的中文版本与非中文版本之间存在冲突，应以中文版本为准。</p>
      <p>5. 本政策自2018年4月8日起适用。 本政策未尽事宜，您需遵守维基链不时更新的公告及相关规则。&nbsp;</p>
    </div>
    <div class="wrapper" v-else>
      <p style="margin-top:0;">Dear users:</p>
      <p>For any third parties or users who have objection to this legal statement, please do not continue to use WaykiChain services. If you continue to use WaykiChain, you are indicating that you have read and fully agreed with this statement.</p>
      <p>(1) WaykiChain is a platform that supports Turing-complete smart contracts. Smart contracts can be used for various commercial scenarios such as assets offering, game prediction, copyright verification and cross-border settlement.</p>
      <p>(2) WaykiChain is a public blockchain. After opening its API, WaykiChain, like Ethereum and other public chains, can be used by individuals (including users) and organizations (hereinafter referred to as "Third parties") worldwide to develop and run applications including assets offering, game prediction and copyright verification (hereinafter referred to as "Third-party application").</p>
      <p>(3) WaykiChain prediction DApp is developed to test the stability and security of WakiChain public chain. It is also an entry point to accumulate users. What needs to be stated is that WaykiChain Official only runs prediction games and will not involve in any fiat currency-based gambling or lottery activities. What are used in the prediction games are game tokens issued by smart contract.</p>
      <p>(4) Applications or websites developed and run by third parties based on WaykiChain public chain, need to comply with the local laws and policies. Developers and operators can launch and run their apps on WaykiChain public chain only after they get the permits and qualifications required by the local laws and policies. If third-party prediction application involves fiat currency exchange, they may need to obtain the lottery license or permit. In principle, WaykiChain Official will require third parties to obtain the license or permit that complies with local laws and policies before they run the applications. But prediction apps developed and run on WaykiChain are operating among individuals, WaykiChain Official or any other third party will not be bankers nor accept any users' stake. Thus WaykiChain Official cannot define whether the applications have the attributes of lottery and prediction, whether the operators need to obtain permits and whether it complies with regulation policies. Because of the limitations, WaykiChain Official will not guarantee the legality of third parties' behavior. However, WaykiChain Official solemnly stated that there is no investing, shareholding, or controlling relationship between WaykiChain Official and those previously mentioned gambling-related third parties.</p>
      <p>(5) The fairness, justness, and transparency advocated by WaykiChain are realized by the characteristics of public blockchain technology, not by the supervision fromWaykiChain Official or any other centralized organizations. After opening its API, WaykiChain Official is unable to control the behavior of third parties. Third parties will bear the legal responsibility by themselves. WaykiChain shall not be responsible for the behavior, or provide any kind of guarantee or promise for the legality of the third parties. However, if third parties' actions are</p>
      <p>suspected of violating the laws or infringing other users' rights, WaykiChain reserve the right to cooperate with local authorities in accordance with law.</p>
      <p>(6) When users use applications developed on WaykiChain, they should be in compliance with local laws and policies of the country or region they located. If the users' participation are prohibited or restricted by relevant laws or policies, the users should not continue to use the applications. WaykiChain Official shall not bear any responsibility for the legality of users' behavior or provide any guarantee or promise.</p>
      <p>(7) This statement is only for the third parties' legality on WaykiChain. For other activities regarding to WaykiChain, please refer to the relevant statements or announcements published by WaykiChain Official.</p>
      <p>(8) If any information or announcement published by WaykiChain Officialpreviously is inconsistent with this statement, this statement shall prevail. If there are any changes or adjustments, please refer to the latest statement published by WaykiChain.</p>
      <h2 class="ql-indent-7">Risk Indication</h2>
      <p>Blockchain industry is still in its early stage, and faces the potential risks of policy, technical security, and financial cycle, etc. Normally, the price of cryptocurrency fluctuates in a big range.</p>
      <p>WaykiChain suggests that investors should invest in WaykiChain with no more than 10% of your personal assets. Investors must be compliance in local laws and regulations, and be liable of own profits and losses. WaykiChain does not provide any kind of guarantee in any form.&nbsp;</p>
    </div>
  </div>
</template>

<script>
import NavLayout from "../components/nav-layout";
export default {
  data() {
    return {
      isCN:
        localStorage.getItem("WICC_WALLET_LANGUAGE") === "zh-CN" || navigator.language.indexOf('zh') > -1 ? true : false
    };
  },
  components: {
    NavLayout
  },
  methods: {}
};
</script>

<style lang="scss" scoped>
.protocol {
  height: 100%;
}
.wrapper {
  height: calc(100% - 74px);
  overflow: auto;
  padding: 0 24px 16px;
  box-sizing: border-box;
}
h2 {
  font-size: 15px;
  line-height: 22px;
  color: #21264A;
  font-weight: 500;
  text-align: center;
  letter-spacing: normal;
  margin-bottom: 0;
}
h3 {
  font-size: 14px;
  line-height: 22px;
  color: #21264A;
  font-weight: 500;
  margin-top: 16px;
  letter-spacing: normal;
  margin-bottom: 0;
}
p {
  font-size: 13px;
  line-height: 22px;
  color: #21264A;
  margin-top: 12px;
  margin-bottom: 0;
}
.ql-indent-7 {
    margin-top: 16px;
}
</style>